doc/linux/nvidia/optimus/libglvnd/2020/03/10/nvidia-libglvnd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-28 Thu 02:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nvidia Optimus: libglvnd</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://gongzhitaao.org/orgcss/org.css" type="text/css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.10.0/styles/googlecode.min.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="/about.html">about</a>
</div>
<div id="content">
<h1 class="title">Nvidia Optimus: libglvnd</h1>

<div id="outline-container-org4ac86f5" class="outline-2">
<h2 id="org4ac86f5"><span class="section-number-2">1</span> Configuration</h2>
<div class="outline-text-2" id="text-1">
<p>
/etc/X11/xorg.conf.d/30-nvidia.conf:
</p>
<div class="org-src-container">
<pre class="src src-sh">Section <span class="org-string">"ServerLayout"</span>
      Identifier <span class="org-string">"layout"</span>
      Screen 0 <span class="org-string">"iGPU"</span>
      Option <span class="org-string">"AllowNVIDIAGPUScreens"</span>
EndSection

Section <span class="org-string">"Device"</span>
      Identifier <span class="org-string">"iGPU"</span>
      Driver <span class="org-string">"modesetting"</span>
      BusID <span class="org-string">"PCI:0:2:0"</span>
EndSection

Section <span class="org-string">"Screen"</span>
      Identifier <span class="org-string">"iGPU"</span>
      Device <span class="org-string">"iGPU"</span>
EndSection

Section <span class="org-string">"Device"</span>
      Identifier <span class="org-string">"nvidia"</span>
      Driver <span class="org-string">"nvidia"</span>
      BusID <span class="org-string">"PCI:2:0:0"</span>
EndSection
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3c7684" class="outline-2">
<h2 id="orgc3c7684"><span class="section-number-2">2</span> Tests</h2>
<div class="outline-text-2" id="text-2">
<p>
glxinfo:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ <span class="org-variable-name">__NV_PRIME_RENDER_OFFLOAD_PROVIDER</span>=NVIDIA-G0 <span class="org-sh-escaped-newline">\</span>
    <span class="org-variable-name">__GLX_VENDOR_LIBRARY_NAME</span>=nvidia <span class="org-sh-escaped-newline">\</span>
    glxinfo egrep <span class="org-string">'(renderer|vendor) string'</span>

server glx vendor string: NVIDIA Corporation
client glx vendor string: NVIDIA Corporation
OpenGL vendor string: NVIDIA Corporation
OpenGL renderer string: GeForce 940MX/PCIe/SSE2
</pre>
</div>

<p>
glxgears:
</p>
<div class="org-src-container">
<pre class="src src-sh">$ <span class="org-variable-name">__NV_PRIME_RENDER_OFFLOAD_PROVIDER</span>=NVIDIA-G0 <span class="org-sh-escaped-newline">\</span>
    <span class="org-variable-name">__GLX_VENDOR_LIBRARY_NAME</span>=nvidia <span class="org-variable-name">__GL_SYNC_TO_VBLANK</span>=0 <span class="org-sh-escaped-newline">\</span>
    glxgears

22971 frames<span class="org-keyword"> in</span> 5.0 seconds = 4594.111 FPS
22384 frames<span class="org-keyword"> in</span> 5.0 seconds = 4476.774 FPS
23685 frames<span class="org-keyword"> in</span> 5.0 seconds = 4737.000 FPS
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
2020
</div>
</body>
</html>
